In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# 1. TO read data set:-

In [15]:
import pandas as pd 

df = pd.read_excel('studentdata.xlsx ')

print(df)

    name  score    address  height  weight
0   Mark   56.0  Bangalore   175.0    55.0
1    Bob   45.0     Mumbai     5.0    64.0
2  Peter   90.0       Pune   164.0    58.0
3   Bill    NaN        NaN     NaN     NaN
4  Steve   99.0    Chennai   162.0    59.0

In [19]:
df.head(2)

   name  score    address  height  weight
0  Mark   56.0  Bangalore   175.0    55.0
1   Bob   45.0     Mumbai     5.0    64.0

In [20]:
df.tail()

    name  score    address  height  weight
0   Mark   56.0  Bangalore   175.0    55.0
1    Bob   45.0     Mumbai     5.0    64.0
2  Peter   90.0       Pune   164.0    58.0
3   Bill    NaN        NaN     NaN     NaN
4  Steve   99.0    Chennai   162.0    59.0

In [35]:
df.tail(2)

    name  score  address
3   Bill    NaN      NaN
4  Steve   99.0  Chennai

In [ ]:
# Handling unnecessary data(columns) :-

df.drop[('height','weight'), axis = 1, inplace=True]
# df

In [ ]:
df.drop(['Height','Weight'], axis = 1)

In [45]:
df

    name  score    address
0   Mark   56.0  Bangalore
1    Bob   45.0     Mumbai
2  Peter   90.0       Pune
3   Bill    NaN        NaN
4  Steve   99.0    Chennai

In [ ]:
# 3. Handling Missing value

# * fillna()

df['score'].fillna((df['score'].mean()), inplace = True)

In [42]:
df

    name  score    address
0   Mark   56.0  Bangalore
1    Bob   45.0     Mumbai
2  Peter   90.0       Pune
3   Bill    NaN        NaN
4  Steve   99.0    Chennai

In [46]:
# 4. Removing Null data
# dropna()

df.dropna()                                                     # it drops rows with 1 or non value

    name  score    address
0   Mark   56.0  Bangalore
1    Bob   45.0     Mumbai
2  Peter   90.0       Pune
4  Steve   99.0    Chennai

In [ ]:
## *** ON monday on words completed topics of Data cleaning n Data preprocess.